PROBLEM_LANGUAGE = 'You have a problem with the selected language. You need'\
                    'to re-enter your language information.'


START_MESSAGE = {
    'ru': '''Fast date - это украинский продукт 🇺🇦. Который объединяет людей по всему миру 🌍. 

⬇️Start Ваше путешествие с Fast Date⬇️''',
    'uk': '''Fast date - це український 🇺🇦 продукт. Який об'єднує людей по всьому світу 🌍. 

⬇️Start свою подорож з Fast Date⬇️''',
    'en': '''Fast date is a Ukrainian 🇺🇦 product. Which unites people all over the world 🌍 

⬇️Start your journey with Fast Date⬇️''',
}

DEACTIVATE_MESSAGE = {
    'ru': 'Ваш аккаунт был вновь активирован. Проверьте настройки поиска.',
    'uk': 'Ваш акаунт було знову активовано. Перевірте налаштування пошуку.',
    'en': 'Your account has been reactivated. Check your search settings.',
}

ACTIVATE_MESSAGE = {
    'ru': 'Ваш аккаунт активен и готов к новым поискам.',
    'uk': 'Ваш акаунт активний і готовий до нових пошуків.',
    'en': 'Your account is active and ready for new searches.',
}

DELETE_MESSAGE = {
    'ru': 'Ваш аккаунт был удален. В любой момент вы можете вернуться.',
    'uk': 'Ваш акаунт було видалено. У будь-який момент ви можете повернутися.',
    'en': 'Your account has been deleted. You can return at any time.',
}

GOLD_MESSAGE= {
    'ru': 'На ваш аккаунт активирован GOLD статус.',
    'uk': 'На ваш акаунт активовано GOLD статус.',
    'en': 'GOLD status has been activated on your account.',
}

CHANGE_LANGUAGE = {
    'ru': 'Язык сменен на русский.',
    'uk': 'Язык змінений на український.',
    'en': 'Language changed to English.',
}

REG_NAME = {
    'ru': 'Введите ваше имя:',
    'uk': 'Введіть ваше ім\'я:',
    'en': 'Enter your name:',
}