PROBLEM_LANGUAGE = 'You have a problem with the selected language. You need'\
                    'to re-enter your language information.'


START_MESSAGE = {
    'ru': '''Fast date - это украинский продукт 🇺🇦. Который объединяет людей по всему миру 🌍. 

⬇️Start Ваше путешествие с Fast Date⬇️\n/info\n/help\n/gold\n/deactivate\n/delete''',
    'uk': '''Fast date - це український 🇺🇦 продукт. Який об'єднує людей по всьому світу 🌍. 

⬇️Start свою подорож з Fast Date⬇️\n/info\n/help\n/gold\n/deactivate\n/delete''',
    'en': '''Fast date is a Ukrainian 🇺🇦 product. Which unites people all over the world 🌍 

⬇️Start your journey with Fast Date⬇️\n/info\n/help\n/gold\n/deactivate\n/delete''',
}

DEACTIVATE_MESSAGE = {
    'ru': 'Ваш аккаунт был вновь активирован. Проверьте настройки поиска.',
    'uk': 'Ваш акаунт було знову активовано. Перевірте налаштування пошуку.',
    'en': 'Your account has been reactivated. Check your search settings.',
}

ACTIVATE_MESSAGE = {
    'ru': 'Ваш аккаунт активен и готов к новым поискам.',
    'uk': 'Ваш акаунт активний і готовий до нових пошуків.',
    'en': 'Your account is active and ready for new searches.',
}

DELETE_MESSAGE = {
    'ru': 'Ваш аккаунт был удален. В любой момент вы можете вернуться.',
    'uk': 'Ваш акаунт було видалено. У будь-який момент ви можете повернутися.',
    'en': 'Your account has been deleted. You can return at any time.',
}

GOLD_MESSAGE= {
    'ru': 'На ваш аккаунт активирован GOLD статус.',
    'uk': 'На ваш акаунт активовано GOLD статус.',
    'en': 'GOLD status has been activated on your account.',
}

CHANGE_LANGUAGE = {
    'ru': 'Язык сменен на русский.',
    'uk': 'Язык змінений на український.',
    'en': 'Language changed to English.',
}

REG_NAME = {
    'ru': 'Введите ваше имя:',
    'uk': 'Введіть ваше ім\'я:',
    'en': 'Enter your name:',
}

REG_AGE = {
    'ru': 'Введите ваш возраст:',
    'uk': 'Введіть ваш вік:',
    'en': 'Enter your age:',
}

REG_GENDER = {
    'ru': 'Выберите ваш пол:',
    'uk': 'Виберіть ваш пол:',
    'en': 'Select your gender:',
}

REG_INFO = {
    'ru': 'Введите ваше информацию:',
    'uk': 'Введіть вашу інформацію:',
    'en': 'Enter your information:',
}

REG_PHOTO = {
    'ru': 'Введите ваше фото:',
    'uk': 'Введіть вашу фото:',
    'en': 'Enter your photo:',
}

REG_LOCATION = {
    'ru': 'Введите ваше местоположение:',
    'uk': 'Введіть вашу місцезнаходження:',
    'en': 'Enter your location:',
}

REG_RANGE = {
    'ru': 'Введите ваш радиус поиска:',
    'uk': 'Введіть ваш радіус пошуку:',
    'en': 'Enter your search radius:',
}

LIKE = {
    'ru': '♥  Лайк',
    'uk': '♥  Лайк',
    'en': '♥  Like',
}

DISLIKE = {
    'ru': '👎 Дизлайк',
    'uk': '👎 Дизлайк',
    'en': '👎 Dislike',
}

MENU = {
    'ru': 'Меню',
    'uk': 'Меню',
    'en': 'Menu',
}